app/views/volunteers/index.html.erb

SELECT "volunteers".* FROM "volunteers"
---
  </tr>
<% group.volunteers.each do |volunteer| %>