app/views/groups/show.html.erb

    <% if crew_wish.group_id %>
    <td<% if crew_wish.group == @group %> style="font-weight: bold;"<% end %>><%= crew_wish.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1