app/views/band_members/index.html.erb

SELECT "band_members".* FROM "band_members"
---
  </tr>
<% band.band_members.each do |band_member| %>