app/views/bands/index.html.erb

      <td><%= band.playtime_wish_alt %></td>
      <td><%= band.band_members.count %></td>
---
SELECT "bands".* FROM "bands"
SELECT COUNT(*) FROM "band_members" WHERE ("band_members".band_id = 'f2e11926-5415-11e0-b4d9-0021851a652a')