app/views/bands/show.html.erb

SELECT "band_members".* FROM "band_members" WHERE ("band_members".band_id = 'f2e11926-5415-11e0-b4d9-0021851a652a')
---
  </tr>
<% @band.band_members.each do |band_member| %>