app/controllers/band_members_controller.rb

  def index
    @band_members = BandMember.all
---
SELECT "band_members".* FROM "band_members"

  def show
    @band_member = BandMember.find(params[:id])
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."id" = 1 LIMIT 1

  def new
    @band_member = BandMember.new
    @band_member.build_person
    @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = 1 LIMIT 1

  def edit
    @band_member = BandMember.find(params[:id])
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."id" = 2 LIMIT 1

  def create
    @band_member = BandMember.new(params[:band_member])
    @band = Band.find(params[:band_id])
    @band.band_members << @band_member
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = 1 LIMIT 1
INSERT INTO "band_members" ("role", "updated_at", "created_at", "name", "band_id") VALUES ('Vokalist', '2011-03-22 02:00:35.511865', '2011-03-22 02:00:35.511865', 'Thomas Geirhovd', 'f2e11926-5415-11e0-b4d9-0021851a652a') RETURNING "id"

  def update
    @band_member = BandMember.find(params[:id])

    respond_to do |format|
      if @band_member.update_attributes(params[:band_member])
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."id" = 2 LIMIT 1
UPDATE "band_members" SET "updated_at" = '2011-03-22 02:20:07.818443', "role" = 'Vokalista' WHERE "band_members"."id" = 2