app/controllers/bands_controller.rb

INSERT INTO "bands" ("email", "playtime_wish", "song_composer", "name", "description", "image_updated_at", "uuid", "image_content_type", "updated_at", "image_file_size", "contact_name", "created_at", "address", "song_lyrics", "playtime_wish_alt", "phone", "image_file_name", "song_title") VALUES ('tg90nor@gmail.com', 'nthdiuee', 'nthdiuee', 'Honningbarna', 'nthdiiueuoe', '2011-03-21 23:50:06.434544', 'f2e11926-5415-11e0-b4d9-0021851a652a', 'image/png', '2011-03-21 23:50:06.778150', 22122, 'Han derre', '2011-03-21 23:50:06.778150', 'aueidhw', 'idhdtns', 'uoeidht', '555555', 'lintedlogo.png', 'iidihthnts')
---
  def create
    @band = Band.new(band_params)
    @band.event = ActiveEvent.first.event if ActiveEvent.first

    respond_to do |format|
      if @band.save

UPDATE "bands" SET "playtime_wish_alt" = '07:00', "song_lyrics" = 'En zebra var årsak,
---
  def update
    @band = Band.find(params[:id])

    respond_to do |format|
      if @band.update(band_params)