app/controllers/fireguards_controller.rb

  def index
    @fireguards = Fireguard.all
---
SELECT "fireguards".* FROM "fireguards"

  def show
    @fireguard = Fireguard.find(params[:id])
---
SELECT "fireguards".* FROM "fireguards" WHERE "fireguards"."id" = 1 LIMIT 1

  def edit
    @fireguard = Fireguard.find(params[:id])
---
SELECT "fireguards".* FROM "fireguards" WHERE "fireguards"."id" = 1 LIMIT 1

  def create
    @fireguard = Fireguard.new(params[:fireguard])

    respond_to do |format|
      if @fireguard.save
---
INSERT INTO "fireguards" ("notes", "address", "age", "active", "phone", "mobile", "created_at", "name", "email", "updated_at") VALUES ('', 'ueid', 20, 't', '', '', '2011-03-28 00:05:23.785761', 'Thomas Geirhovd', '', '2011-03-28 00:05:23.785761') RETURNING "id"