app/controllers/groups_controller.rb

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("type", "updated_at", "name", "created_at") VALUES (NULL, '2011-03-27 20:35:12.025775', 'Brannvakter', '2011-03-27 20:35:12.025775') RETURNING "id"