app/controllers/location_schedules_controller.rb

SELECT "bands".* FROM "bands"
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1
---
  def show_schedule
    bands = Band.all
    @events = []
    bands.each do |band|
      if !band.stage_schedule
        @events << band
      end
    end
    @stage = Stage.find(params[:id])