app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "updated_at", "slots", "created_at") VALUES ('Hisnakul', '2011-03-27 17:46:01.980509', NULL, '2011-03-27 17:46:01.980509') RETURNING "id"
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
UPDATE "locations" SET "slots" = 2, "updated_at" = '2011-03-27 17:46:12.743100' WHERE "locations"."id" = 1
---
  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])