app/controllers/stages_controller.rb

  def index
    @stages = Stage.all
---
SELECT "stages".* FROM "stages"

  def show
    @stage = Stage.find(params[:id])
---
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1

  def edit
    @stage = Stage.find(params[:id])
---
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1

  def create
    @stage = Stage.new(stage_params)

    respond_to do |format|
      if @stage.save
---
INSERT INTO "stages" ("created_at", "to", "from", "name", "updated_at") VALUES ('2011-03-23 12:35:59.266332', '2011-04-17 02:00:00.000000', '2011-04-15 18:00:00.000000', 'Idrettshallen', '2011-03-23 12:35:59.266332') RETURNING "id"