app/controllers/stage_schedules_controller.rb

  def get_events
    stage_schedules = Stage.find(params[:id]).stage_schedules
---
SELECT "stage_schedules".* FROM "stage_schedules" WHERE ("stage_schedules".stage_id = 1)
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1

  def show_schedule
    bands = Band.all
    @events = []
    bands.each do |band|
      if !band.stage_schedule
        @events << band
      end
    end
    if params[:id]
      @stage = Stage.find(params[:id])
---
SELECT "bands".* FROM "bands"
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1

  def create
    band = Band.find(params[:band_id])
    stage = Stage.find(params[:id])
    stage_schedule = StageSchedule.new
    band.stage_schedule = stage_schedule
    stage_schedule.start = DateTime.civil(params[:year].to_i, params[:month].to_i, params[:day].to_i, params[:hour].to_i, params[:minute].to_i)
    stage_schedule.end = DateTime.civil(params[:year].to_i, params[:month].to_i, params[:day].to_i, params[:hour].to_i, params[:minute].to_i)
    stage_schedule.end = stage_schedule.end.advance(:minutes => 15)
    stage.stage_schedules << stage_schedule
---
SELECT "stages".* FROM "stages" WHERE "stages"."id" = 1 LIMIT 1
INSERT INTO "stage_schedules" ("stage_id", "from", "updated_at", "to", "band_id", "created_at") VALUES (1, '2011-04-06 00:00:00.000000', '2011-03-24 13:30:03.669626', '2011-04-06 00:15:00.000000', NULL, '2011-03-24 13:30:03.669626') RETURNING "id"

  def move
    band = Band.find(params[:band_id])
    stage_schedule = band.stage_schedule
    stage_schedule.start = stage_schedule.start.advance(:days => params[:day_delta].to_i, :minutes => params[:minute_delta].to_i)
    stage_schedule.end = stage_schedule.end.advance(:days => params[:day_delta].to_i, :minutes => params[:minute_delta].to_i)
    stage_schedule.save
---
UPDATE "stage_schedules" SET "updated_at" = '2011-03-24 14:19:26.657822', "to" = '2011-04-16 00:30:00.000000', "from" = '2011-04-16 00:15:00.000000' WHERE "stage_schedules"."id" = 4