app/controllers/volunteers_controller.rb

SELECT "volunteers".* FROM "volunteers"
---
  def index
    @groups = Group.includes(:volunteers).where.not(volunteers: { id: nil }).order('volunteers.name ASC')

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 1 LIMIT 1
---
  def show
    @volunteer = Volunteer.find(params[:id])

INSERT INTO "volunteers" ("notes", "contact_id", "birthday", "updated_at", "created_at") VALUES ('hdi', 1, '2011-03-27', '2011-03-27 18:51:42.749757', '2011-03-27 18:51:42.749757') RETURNING "id"
---
  def create
    @volunteer = Volunteer.new(volunteer_params)

    respond_to do |format|
      if @volunteer.save